//==================================================================================
// 
// エサに関する処理[esa.h]
// Author : Soki Inamura 
// 
//==================================================================================

#ifndef _ESA_H_
#define _ESA_H_


// 構造体の定義 ================================================


// プロトタイプ宣言 ============================================

void InitEsa(void);			// エサの初期化処理
void UninitEsa(void);		// エサの終了処理
void UpdateEsa(void);		// エサの更新処理
void DrawEsa(void);			// エサの描画処理

void SetEsa					// エサの設定処理
(int nType, D3DXVECTOR3 pos, D3DXVECTOR3 rot);				

#endif
