//=============================================================================
// 
// ライトヘッダー [light.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _LIGHT_H_		// このマクロ定義がされていなかったら
#define _LIGHT_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLight(void);
void UninitLight(void);
void UpdateLight(void);
void SetLightColor(int nIdx, D3DXCOLOR col);

#endif