//=============================================================================
// 
// スポットライトヘッダー [spotlight.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _SPOTLIGHT_H_		// このマクロ定義がされていなかったら
#define _SPOTLIGHT_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitSpotLight(void);
void UninitSpotLight(void);
void UpdateSpotLight(void);
void SetSpotLightColor(int nIdx, D3DXCOLOR col);

#endif