//=============================================================================
// 
// ビルボードヘッダー [billboard.h]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _BILLBOARD_H_		// このマクロ定義がされていなかったら
#define _BILLBOARD_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBillboard(void);
void UninitBillboard(void);
void UpdateBillboard(void);
void DrawBillboard(void);

#endif